## Final Project Submission

Please fill out:
* Student name: Daniel Bradley and Alex Williams
* Student pace: full-time
* Scheduled project review date/time: 03/09/2022
* Instructor name: Praveen Gowtham

In [1]:
# Your code here - remember to use markdown cells for comments as well!
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sqlite3

In [2]:
#Load 
df = pd.read_csv('zippedData/tmdb.movies.csv')

In [3]:
df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

In [2]:
conn = sqlite3.connect('zippedData/im.db')

In [6]:
q= """
SELECT *
FROM principals
"""

df = pd.read_sql(q, conn)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   movie_id    1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   person_id   1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         177684 non-null   object
 5   characters  393360 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

In [14]:
df.head(30)

,movie_id,ordering,person_id,category,job,characters
0,tt0111414,1,nm0246005,actor,None,"[""The Man""]"
1,tt0111414,2,nm0398271,director,None,None
2,tt0111414,3,nm3739909,producer,producer,None
3,tt0323808,10,nm0059247,editor,None,None
4,tt0323808,1,nm3579312,actress,None,"[""Beth Boothby""]"
5,tt0323808,2,nm2694680,actor,None,"[""Steve Thomson""]"
6,tt0323808,3,nm0574615,actor,None,"[""Sir Lachlan Morrison""]"
7,tt0323808,4,nm0502652,actress,None,"[""Lady Delia Morrison""]"
8,tt0323808,5,nm0362736,director,None,None
9,tt0323808,6,nm0811056,producer,producer,None
10,tt0323808,7,nm0914939,producer,producer,None
11,tt0323808,8,nm0779346,composer,None,None
12,tt0323808,9,nm0676104,cinematographer,None,None
13,tt0417610,10,nm0284261,composer,None,None
14,tt0417610,1,nm0532721,actor,None,"[""Lucio""]"
15,tt0417610,2,nm0330974,actress,None,"[""Diana""]"
16,tt0417610,3,nm0069209,actor,None,"[""Dr. Samaniego""]"
17,tt0417610,4,nm0679167,actress,None,"[""Adriana María""]"
18,tt0417610,5,nm1145057,director,None,None
19,tt0417610,6,nm0083201,writer,story,None
20,tt0417610,7,nm0147416,producer,producer,None
21,tt0417610,8,nm0215732,producer,producer,None
22,tt0417610,9,nm1900304,producer,producer,None
23,tt0469152,10,nm3745712,editor,None,None
24,tt0469152,1,nm0036109,actress,None,"[""Eleanor Jordan""]"
25,tt0469152,2,nm0005253,actress,None,"[""Diana Whelan""]"
26,tt0469152,3,nm0002090,actor,None,"[""Anson""]"
27,tt0469152,4,nm1469262,actor,None,"[""Jack Jordan Jr.""]"
28,tt0469152,5,nm0707738,director,None,None
29,tt0469152,6,nm0071770,writer,None,None

***
***
# SEPARATOR CELL - 
DANIEL WORK ABOVE THIS CELL, ALEX WORK BELOW
***
***